import React, {FC, useState} from 'react';
import { Link } from 'react-router-dom';
import Button from '../../common/Button';
//import SavedCartItem from './SavedCartItem';

/**
 * Сохраненная корзина в списке корзин в профиле пользователя
 * @returns JSX
 */
const SavedCart: FC<any> = (props: any) => {

    const {cartId} = props; // набор товаров в корзине. заменить id на товар
    const [isShowProducts, setIsShowProducts] = useState<boolean>(false);

	return(
        <div className="personal-saved-cart">
            <div className={isShowProducts ? 'open' : 'closed'}>
                <div>
                    <div>
                        <button className="uk-button uk-button-link" title="Удалить корзину">
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M21.5667 20L29.6667 11.9C29.8487 11.6874 29.9438 11.414 29.933 11.1344C29.9222 10.8548 29.8063 10.5895 29.6084 10.3916C29.4105 10.1937 29.1452 10.0778 28.8656 10.067C28.586 10.0562 28.3126 10.1513 28.1 10.3333L20 18.4333L11.9 10.3222C11.6874 10.1402 11.414 10.0451 11.1344 10.0559C10.8547 10.0667 10.5895 10.1826 10.3916 10.3805C10.1937 10.5784 10.0778 10.8436 10.067 11.1233C10.0562 11.4029 10.1513 11.6763 10.3333 11.8889L18.4333 20L10.3222 28.1C10.2059 28.1996 10.1114 28.3222 10.0447 28.46C9.97805 28.5979 9.94058 28.748 9.93467 28.9011C9.92876 29.0541 9.95454 29.2067 10.0104 29.3493C10.0663 29.4918 10.151 29.6213 10.2593 29.7296C10.3676 29.8379 10.4971 29.9226 10.6396 29.9785C10.7822 30.0343 10.9348 30.0601 11.0878 30.0542C11.2409 30.0483 11.391 30.0108 11.5289 29.9441C11.6667 29.8775 11.7893 29.783 11.8889 29.6667L20 21.5667L28.1 29.6667C28.3126 29.8487 28.586 29.9438 28.8656 29.933C29.1452 29.9222 29.4105 29.8063 29.6084 29.6084C29.8063 29.4105 29.9222 29.1453 29.933 28.8656C29.9438 28.586 29.8487 28.3126 29.6667 28.1L21.5667 20Z" fill="#F76161"/>
                            </svg>
                        </button>
                    </div>
                    
                    <div>
                        
                        <div>
                            <h4>Корзина {cartId}</h4>
                        </div>
                        <div>
                            <div>
                                <h5>Комментарий:</h5>
                                <p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Lorem ipsum dolor sit amet, consectetur adipiscing elit.</p>
                            </div>
                            <div>
                                <h5>Выбрано для:</h5>
                                <Link to="/profile"><img src="./img/shops/lenta.png" alt="Лента" /></Link>
                            </div>
                            <div>
                                <h5>Цена:</h5>
                                <p><span>1316</span> <span>₽</span></p>
                            </div>
                        </div>
                    </div>
                    {
                        !isShowProducts ?
                        <Button 
                            type="button"
                            classlist={"uk-button uk-button-primary"}
                            style={{
                                padding: "0.8rem 1rem",
                                height: "auto",
                                fontSize: "16px",
                                fontWeight: "600"
                            }}
                            onClick={() => setIsShowProducts(true)}
                            text="Смотреть"
                        /> :
                        <Button 
                            type="button"
                            classlist={"uk-button uk-button-primary"}
                            style={{
                                padding: "0.8rem 1rem",
                                height: "auto",
                                color: "#262626",
                                backgroundColor: "#fff",
                                border: "1px #43B727 solid",
                                fontSize: "16px",
                                fontWeight: "600"
                            }}
                            onClick={() => setIsShowProducts(false)}
                            text="Свернуть"
                        />
                    }
                </div>
            </div>
            {
                isShowProducts &&
                <div className="saved-cart">
                    <div>
                        <p>Чтобы переместить товар в другую корзину, переместите его</p>
                        <h5>Цена с картой магазина / без</h5>
                    </div>
                    <table className="uk-table uk-table-responsive uk-table-small uk-table-divider">
                        <thead>
                            <tr>
                                <th className="uk-width-3-5 uk-text-left">Наименование</th>
                                <th className="uk-width-1-5 uk-text-center">Кол-во</th>
                                <th className="uk-width-1-5 uk-text-center">Цена</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>
                                    <div>
                                        <div>
                                            <button className="uk-button uk-button-link">
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <rect x="6" y="7" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="11" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="15" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                </svg>
                                            </button>
                                            <p>Молоко домик в деревне 5%</p>
                                        </div>
                                        
                                        <button className="uk-button uk-button-link" title="Удалить">
                                            <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M7.65425 5.99999L12.5143 1.13999C12.6235 1.01246 12.6805 0.848406 12.6741 0.680622C12.6676 0.512838 12.598 0.353679 12.4793 0.234949C12.3606 0.116219 12.2014 0.0466642 12.0336 0.0401834C11.8658 0.0337026 11.7018 0.0907736 11.5743 0.199991L6.71426 5.05999L1.85426 0.193324C1.72672 0.0841068 1.56267 0.0270364 1.39489 0.0335172C1.2271 0.039998 1.06794 0.109553 0.949214 0.228282C0.830485 0.347012 0.76093 0.506171 0.754449 0.673955C0.747968 0.841739 0.805039 1.00579 0.914257 1.13332L5.77426 5.99999L0.90759 10.86C0.837802 10.9198 0.781122 10.9933 0.741106 11.076C0.701091 11.1587 0.678604 11.2488 0.675057 11.3406C0.671511 11.4324 0.686982 11.524 0.720498 11.6095C0.754014 11.6951 0.804853 11.7728 0.869823 11.8378C0.934793 11.9027 1.01249 11.9536 1.09804 11.9871C1.18359 12.0206 1.27515 12.0361 1.36696 12.0325C1.45877 12.029 1.54886 12.0065 1.63157 11.9665C1.71428 11.9265 1.78782 11.8698 1.84759 11.8L6.71426 6.93999L11.5743 11.8C11.7018 11.9092 11.8658 11.9663 12.0336 11.9598C12.2014 11.9533 12.3606 11.8838 12.4793 11.765C12.598 11.6463 12.6676 11.4871 12.6741 11.3194C12.6805 11.1516 12.6235 10.9875 12.5143 10.86L7.65425 5.99999Z" fill="#F76161"/>
                                            </svg>
                                        </button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <button>-</button>
                                        <span>1</span>
                                        <button>+</button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <h4>98 <span>₽</span></h4>
                                        <Link to="/profile"><img src="./img/shops/lenta.png" alt="Лента" /></Link>
                                    </div>
                                </td>
                            </tr>
                            <tr>
                                <td>
                                    <div>
                                        <div>
                                            <button className="uk-button uk-button-link">
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <rect x="6" y="7" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="11" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="15" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                </svg>
                                            </button>
                                            <p>Сыр Laime 5%</p>
                                        </div>
                                        <button  className="uk-button uk-button-link" title="Удалить">
                                            <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M7.65425 5.99999L12.5143 1.13999C12.6235 1.01246 12.6805 0.848406 12.6741 0.680622C12.6676 0.512838 12.598 0.353679 12.4793 0.234949C12.3606 0.116219 12.2014 0.0466642 12.0336 0.0401834C11.8658 0.0337026 11.7018 0.0907736 11.5743 0.199991L6.71426 5.05999L1.85426 0.193324C1.72672 0.0841068 1.56267 0.0270364 1.39489 0.0335172C1.2271 0.039998 1.06794 0.109553 0.949214 0.228282C0.830485 0.347012 0.76093 0.506171 0.754449 0.673955C0.747968 0.841739 0.805039 1.00579 0.914257 1.13332L5.77426 5.99999L0.90759 10.86C0.837802 10.9198 0.781122 10.9933 0.741106 11.076C0.701091 11.1587 0.678604 11.2488 0.675057 11.3406C0.671511 11.4324 0.686982 11.524 0.720498 11.6095C0.754014 11.6951 0.804853 11.7728 0.869823 11.8378C0.934793 11.9027 1.01249 11.9536 1.09804 11.9871C1.18359 12.0206 1.27515 12.0361 1.36696 12.0325C1.45877 12.029 1.54886 12.0065 1.63157 11.9665C1.71428 11.9265 1.78782 11.8698 1.84759 11.8L6.71426 6.93999L11.5743 11.8C11.7018 11.9092 11.8658 11.9663 12.0336 11.9598C12.2014 11.9533 12.3606 11.8838 12.4793 11.765C12.598 11.6463 12.6676 11.4871 12.6741 11.3194C12.6805 11.1516 12.6235 10.9875 12.5143 10.86L7.65425 5.99999Z" fill="#F76161"/>
                                            </svg>
                                        </button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <button>-</button>
                                        <span>1</span>
                                        <button>+</button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <h4>114 <span>₽</span></h4>
                                        <Link to="/profile"><img src="./img/shops/lenta.png" alt="Лента" /></Link>
                                    </div>
                                </td>
                            </tr>
                            <tr>
                                <td>
                                    <div>
                                        <div>
                                            <button className="uk-button uk-button-link">
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <rect x="6" y="7" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="11" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="15" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                </svg>
                                            </button>
                                            <p>Сок Rich яблочный</p>
                                        </div>
                                        <button  className="uk-button uk-button-link" title="Удалить">
                                            <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M7.65425 5.99999L12.5143 1.13999C12.6235 1.01246 12.6805 0.848406 12.6741 0.680622C12.6676 0.512838 12.598 0.353679 12.4793 0.234949C12.3606 0.116219 12.2014 0.0466642 12.0336 0.0401834C11.8658 0.0337026 11.7018 0.0907736 11.5743 0.199991L6.71426 5.05999L1.85426 0.193324C1.72672 0.0841068 1.56267 0.0270364 1.39489 0.0335172C1.2271 0.039998 1.06794 0.109553 0.949214 0.228282C0.830485 0.347012 0.76093 0.506171 0.754449 0.673955C0.747968 0.841739 0.805039 1.00579 0.914257 1.13332L5.77426 5.99999L0.90759 10.86C0.837802 10.9198 0.781122 10.9933 0.741106 11.076C0.701091 11.1587 0.678604 11.2488 0.675057 11.3406C0.671511 11.4324 0.686982 11.524 0.720498 11.6095C0.754014 11.6951 0.804853 11.7728 0.869823 11.8378C0.934793 11.9027 1.01249 11.9536 1.09804 11.9871C1.18359 12.0206 1.27515 12.0361 1.36696 12.0325C1.45877 12.029 1.54886 12.0065 1.63157 11.9665C1.71428 11.9265 1.78782 11.8698 1.84759 11.8L6.71426 6.93999L11.5743 11.8C11.7018 11.9092 11.8658 11.9663 12.0336 11.9598C12.2014 11.9533 12.3606 11.8838 12.4793 11.765C12.598 11.6463 12.6676 11.4871 12.6741 11.3194C12.6805 11.1516 12.6235 10.9875 12.5143 10.86L7.65425 5.99999Z" fill="#F76161"/>
                                            </svg>
                                        </button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <button>-</button>
                                        <span>1</span>
                                        <button>+</button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <h4>118 <span>₽</span></h4>
                                        <Link to="/profile"><img src="./img/shops/lenta.png" alt="Лента" /></Link>
                                    </div>
                                </td>
                            </tr>
                            <tr>
                                <td>
                                    <div>
                                        <div>
                                            <button className="uk-button uk-button-link">
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <rect x="6" y="7" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="11" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                    <rect x="6" y="15" width="12" height="1.5" rx="0.75" fill="#C4C4C4"/>
                                                </svg>
                                            </button>
                                            <p>Индейка Индилайт 900г</p>
                                        </div>
                                        <button className="uk-button uk-button-link" title="Удалить">
                                            <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M7.65425 5.99999L12.5143 1.13999C12.6235 1.01246 12.6805 0.848406 12.6741 0.680622C12.6676 0.512838 12.598 0.353679 12.4793 0.234949C12.3606 0.116219 12.2014 0.0466642 12.0336 0.0401834C11.8658 0.0337026 11.7018 0.0907736 11.5743 0.199991L6.71426 5.05999L1.85426 0.193324C1.72672 0.0841068 1.56267 0.0270364 1.39489 0.0335172C1.2271 0.039998 1.06794 0.109553 0.949214 0.228282C0.830485 0.347012 0.76093 0.506171 0.754449 0.673955C0.747968 0.841739 0.805039 1.00579 0.914257 1.13332L5.77426 5.99999L0.90759 10.86C0.837802 10.9198 0.781122 10.9933 0.741106 11.076C0.701091 11.1587 0.678604 11.2488 0.675057 11.3406C0.671511 11.4324 0.686982 11.524 0.720498 11.6095C0.754014 11.6951 0.804853 11.7728 0.869823 11.8378C0.934793 11.9027 1.01249 11.9536 1.09804 11.9871C1.18359 12.0206 1.27515 12.0361 1.36696 12.0325C1.45877 12.029 1.54886 12.0065 1.63157 11.9665C1.71428 11.9265 1.78782 11.8698 1.84759 11.8L6.71426 6.93999L11.5743 11.8C11.7018 11.9092 11.8658 11.9663 12.0336 11.9598C12.2014 11.9533 12.3606 11.8838 12.4793 11.765C12.598 11.6463 12.6676 11.4871 12.6741 11.3194C12.6805 11.1516 12.6235 10.9875 12.5143 10.86L7.65425 5.99999Z" fill="#F76161"/>
                                            </svg>
                                        </button>
                                    </div>
                                </td>
                                <td>
                                    <div>                                
                                        <button>-</button>
                                        <span>1</span>
                                        <button>+</button>
                                    </div>
                                </td>
                                <td>
                                    <div>
                                        <h4>240 <span>₽</span></h4>
                                        <Link to="/profile"><img src="./img/shops/lenta.png" alt="Лента" /></Link>
                                    </div>
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            }
        </div>
    );
};

export default SavedCart;